RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_mcan_regs.h
/*
 * DBRP (RW)
 *
 * Data Bit Rate Prescaler
 * The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Bit Rate Prescaler are 0 to 31.
 * When TDC = ‘1’, the range is limited to 0,1. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 */
#define MCAN_DBTP_DBRP_MASK (0x1F0000UL)
#define MCAN_DBTP_DBRP_SHIFT (16U)
#define MCAN_DBTP_DBRP_SET(x) (((uint32_t)(x) << MCAN_DBTP_DBRP_SHIFT) & MCAN_DBTP_DBRP_MASK)
#define MCAN_DBTP_DBRP_GET(x) (((uint32_t)(x) & MCAN_DBTP_DBRP_MASK) >> MCAN_DBTP_DBRP_SHIFT)

/*
 * DTSEG1 (RW)
 *
 * Data time segment before sample point
 * Valid values are 0 to 31. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 */
#define MCAN_DBTP_DTSEG1_MASK (0x1F00U)
#define MCAN_DBTP_DTSEG1_SHIFT (8U)
#define MCAN_DBTP_DTSEG1_SET(x) (((uint32_t)(x) << MCAN_DBTP_DTSEG1_SHIFT) & MCAN_DBTP_DTSEG1_MASK)
#define MCAN_DBTP_DTSEG1_GET(x) (((uint32_t)(x) & MCAN_DBTP_DTSEG1_MASK) >> MCAN_DBTP_DTSEG1_SHIFT)

/*
 * DTSEG2 (RW)
 *
 * Data time segment after sample point
 * Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 */
#define MCAN_DBTP_DTSEG2_MASK (0xF0U)
#define MCAN_DBTP_DTSEG2_SHIFT (4U)
#define MCAN_DBTP_DTSEG2_SET(x) (((uint32_t)(x) << MCAN_DBTP_DTSEG2_SHIFT) & MCAN_DBTP_DTSEG2_MASK)
#define MCAN_DBTP_DTSEG2_GET(x) (((uint32_t)(x) & MCAN_DBTP_DTSEG2_MASK) >> MCAN_DBTP_DTSEG2_SHIFT)

/*
 * DSJW (RW)
 *
 * Data (Re)Synchronization Jump Width
 * Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 */
#define MCAN_DBTP_DSJW_MASK (0xFU)
#define MCAN_DBTP_DSJW_SHIFT (0U)
#define MCAN_DBTP_DSJW_SET(x) (((uint32_t)(x) << MCAN_DBTP_DSJW_SHIFT) & MCAN_DBTP_DSJW_MASK)
#define MCAN_DBTP_DSJW_GET(x) (((uint32_t)(x) & MCAN_DBTP_DSJW_MASK) >> MCAN_DBTP_DSJW_SHIFT)

/* Bitfield definition for register: TEST */
/*
 * SVAL (R)
 *
 * Started Valid
 * 0= Value of TXBNS not valid
 * 1= Value of TXBNS valid
 */
#define MCAN_TEST_SVAL_MASK (0x200000UL)
#define MCAN_TEST_SVAL_SHIFT (21U)
#define MCAN_TEST_SVAL_GET(x) (((uint32_t)(x) & MCAN_TEST_SVAL_MASK) >> MCAN_TEST_SVAL_SHIFT)

/*
 * TXBNS (R)
 *
 * Tx Buffer Number Started
 * Tx Buffer number of message whose transmission was started last. Valid when SVAL is set. Valid values are 0 to 31.
 */
#define MCAN_TEST_TXBNS_MASK (0x1F0000UL)
#define MCAN_TEST_TXBNS_SHIFT (16U)
#define MCAN_TEST_TXBNS_GET(x) (((uint32_t)(x) & MCAN_TEST_TXBNS_MASK) >> MCAN_TEST_TXBNS_SHIFT)

/*
 * PVAL (R)
 *
 * Prepared Valid
 * 0= Value of TXBNP not valid
 * 1= Value of TXBNP valid
 */
#define MCAN_TEST_PVAL_MASK (0x2000U)
#define MCAN_TEST_PVAL_SHIFT (13U)
#define MCAN_TEST_PVAL_GET(x) (((uint32_t)(x) & MCAN_TEST_PVAL_MASK) >> MCAN_TEST_PVAL_SHIFT)

/*
 * TXBNP (R)
 *
 * Tx Buffer Number Prepared
 * Tx Buffer number of message that is ready for transmission. Valid when PVAL is set.Valid values are 0 to 31.
 */
#define MCAN_TEST_TXBNP_MASK (0x1F00U)
#define MCAN_TEST_TXBNP_SHIFT (8U)
#define MCAN_TEST_TXBNP_GET(x) (((uint32_t)(x) & MCAN_TEST_TXBNP_MASK) >> MCAN_TEST_TXBNP_SHIFT)

/*
 * RX (R)
 *
 * Receive Pin
 * Monitors the actual value of pin m_can_rx
 * 0= The CAN bus is dominant (m_can_rx = ‘0’)
 * 1= The CAN bus is recessive (m_can_rx = ‘1’)
 */
#define MCAN_TEST_RX_MASK (0x80U)
#define MCAN_TEST_RX_SHIFT (7U)
#define MCAN_TEST_RX_GET(x) (((uint32_t)(x) & MCAN_TEST_RX_MASK) >> MCAN_TEST_RX_SHIFT)

/*
 * TX (RW)
 *
 * Control of Transmit Pin
 * 00 Reset value, m_can_tx controlled by the CAN Core, updated at the end of the CAN bit time
 * 01 Sample Point can be monitored at pin m_can_tx
 * 10 Dominant (‘0’) level at pin m_can_tx
 * 11 Recessive (‘1’) at pin m_can_tx
 */
#define MCAN_TEST_TX_MASK (0x60U)
#define MCAN_TEST_TX_SHIFT (5U)
#define MCAN_TEST_TX_SET(x) (((uint32_t)(x) << MCAN_TEST_TX_SHIFT) & MCAN_TEST_TX_MASK)
#define MCAN_TEST_TX_GET(x) (((uint32_t)(x) & MCAN_TEST_TX_MASK) >> MCAN_TEST_TX_SHIFT)

/*
 * LBCK (RW)
 *
 * Loop Back Mode
 * 0= Reset value, Loop Back Mode is disabled
 * 1= Loop Back Mode is enabled
 */
#define MCAN_TEST_LBCK_MASK (0x10U)
#define MCAN_TEST_LBCK_SHIFT (4U)
#define MCAN_TEST_LBCK_SET(x) (((uint32_t)(x) << MCAN_TEST_LBCK_SHIFT) & MCAN_TEST_LBCK_MASK)
#define MCAN_TEST_LBCK_GET(x) (((uint32_t)(x) & MCAN_TEST_LBCK_MASK) >> MCAN_TEST_LBCK_SHIFT)

/* Bitfield definition for register: RWD */
/*
 * WDV (R)
 *
 * Watchdog Value
 * Actual Message RAM Watchdog Counter Value.
 */
#define MCAN_RWD_WDV_MASK (0xFF00U)
#define MCAN_RWD_WDV_SHIFT (8U)
#define MCAN_RWD_WDV_GET(x) (((uint32_t)(x) & MCAN_RWD_WDV_MASK) >> MCAN_RWD_WDV_SHIFT)

/*
 * WDC (RW)
 *
 * Watchdog Configuration
 * Start value of the Message RAM Watchdog Counter. With the reset value of “00” the counter is disabled.
 */
#define MCAN_RWD_WDC_MASK (0xFFU)
#define MCAN_RWD_WDC_SHIFT (0U)
#define MCAN_RWD_WDC_SET(x) (((uint32_t)(x) << MCAN_RWD_WDC_SHIFT) & MCAN_RWD_WDC_MASK)
#define MCAN_RWD_WDC_GET(x) (((uint32_t)(x) & MCAN_RWD_WDC_MASK) >> MCAN_RWD_WDC_SHIFT)

/* Bitfield definition for register: CCCR */
/*
 * NISO (RW)
 *
 * Non ISO Operation
 * If this bit is set, the M_CAN uses the CAN FD frame format as specified by the Bosch CAN FD
 * Specification V1.0.
 * 0= CAN FD frame format according to ISO 11898-1:2015
 * 1= CAN FD frame format according to Bosch CAN FD Specification V1.0
 * Note: When the generic parameter iso_only_g is set to ‘1’ in hardware synthesis, this bit becomes reserved and is read as ‘0’. The M_CAN always operates with the CAN FD frame format according to ISO 11898-1:2015.
 */
#define MCAN_CCCR_NISO_MASK (0x8000U)
#define MCAN_CCCR_NISO_SHIFT (15U)
#define MCAN_CCCR_NISO_SET(x) (((uint32_t)(x) << MCAN_CCCR_NISO_SHIFT) & MCAN_CCCR_NISO_MASK)
#define MCAN_CCCR_NISO_GET(x) (((uint32_t)(x) & MCAN_CCCR_NISO_MASK) >> MCAN_CCCR_NISO_SHIFT)

