RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_mcan_regs.h
/*
 * TXP (RW)
 *
 * Transmit Pause
 * If this bit is set, the M_CAN pauses for two CAN bit times before starting the next transmission after
 * itself has successfully transmitted a frame (see Section 3.5).
 * 0= Transmit pause disabled
 * 1= Transmit pause enabled
 */
#define MCAN_CCCR_TXP_MASK (0x4000U)
#define MCAN_CCCR_TXP_SHIFT (14U)
#define MCAN_CCCR_TXP_SET(x) (((uint32_t)(x) << MCAN_CCCR_TXP_SHIFT) & MCAN_CCCR_TXP_MASK)
#define MCAN_CCCR_TXP_GET(x) (((uint32_t)(x) & MCAN_CCCR_TXP_MASK) >> MCAN_CCCR_TXP_SHIFT)

/*
 * EFBI (RW)
 *
 * Edge Filtering during Bus Integration
 * 0= Edge filtering disabled
 * 1= Two consecutive dominant tq required to detect an edge for hard synchronization
 */
#define MCAN_CCCR_EFBI_MASK (0x2000U)
#define MCAN_CCCR_EFBI_SHIFT (13U)
#define MCAN_CCCR_EFBI_SET(x) (((uint32_t)(x) << MCAN_CCCR_EFBI_SHIFT) & MCAN_CCCR_EFBI_MASK)
#define MCAN_CCCR_EFBI_GET(x) (((uint32_t)(x) & MCAN_CCCR_EFBI_MASK) >> MCAN_CCCR_EFBI_SHIFT)

/*
 * PXHD (RW)
 *
 * Protocol Exception Handling Disable
 * 0= Protocol exception handling enabled
 * 1= Protocol exception handling disabled
 * Note: When protocol exception handling is disabled, the M_CAN will transmit an error frame when it detects a protocol exception condition.
 */
#define MCAN_CCCR_PXHD_MASK (0x1000U)
#define MCAN_CCCR_PXHD_SHIFT (12U)
#define MCAN_CCCR_PXHD_SET(x) (((uint32_t)(x) << MCAN_CCCR_PXHD_SHIFT) & MCAN_CCCR_PXHD_MASK)
#define MCAN_CCCR_PXHD_GET(x) (((uint32_t)(x) & MCAN_CCCR_PXHD_MASK) >> MCAN_CCCR_PXHD_SHIFT)

/*
 * WMM (RW)
 *
 * Wide Message Marker
 * Enables the use of 16-bit Wide Message Markers. When 16-bit Wide Message Markers are used (WMM = ‘1’), 16-bit internal timestamping is disabled for the Tx Event FIFO.
 * 0= 8-bit Message Marker used
 * 1= 16-bit Message Marker used, replacing 16-bit timestamps in Tx Event FIFO
 */
#define MCAN_CCCR_WMM_MASK (0x800U)
#define MCAN_CCCR_WMM_SHIFT (11U)
#define MCAN_CCCR_WMM_SET(x) (((uint32_t)(x) << MCAN_CCCR_WMM_SHIFT) & MCAN_CCCR_WMM_MASK)
#define MCAN_CCCR_WMM_GET(x) (((uint32_t)(x) & MCAN_CCCR_WMM_MASK) >> MCAN_CCCR_WMM_SHIFT)

/*
 * UTSU (RW)
 *
 * Use Timestamping Unit
 * When UTSU is set, 16-bit Wide Message Markers are also enabled regardless of the value of WMM.
 * 0= Internal time stamping
 * 1= External time stamping by TSU
 * Note: When generic parameter connected_tsu_g = ‘0’, there is no TSU connected to the M_CAN.
 * In this case bit UTSU is fixed to zero by synthesis.
 */
#define MCAN_CCCR_UTSU_MASK (0x400U)
#define MCAN_CCCR_UTSU_SHIFT (10U)
#define MCAN_CCCR_UTSU_SET(x) (((uint32_t)(x) << MCAN_CCCR_UTSU_SHIFT) & MCAN_CCCR_UTSU_MASK)
#define MCAN_CCCR_UTSU_GET(x) (((uint32_t)(x) & MCAN_CCCR_UTSU_MASK) >> MCAN_CCCR_UTSU_SHIFT)

/*
 * BRSE (RW)
 *
 * Bit Rate Switch Enable
 * 0= Bit rate switching for transmissions disabled
 * 1= Bit rate switching for transmissions enabled
 * Note: When CAN FD operation is disabled FDOE = ‘0’, BRSE is not evaluated.
 */
#define MCAN_CCCR_BRSE_MASK (0x200U)
#define MCAN_CCCR_BRSE_SHIFT (9U)
#define MCAN_CCCR_BRSE_SET(x) (((uint32_t)(x) << MCAN_CCCR_BRSE_SHIFT) & MCAN_CCCR_BRSE_MASK)
#define MCAN_CCCR_BRSE_GET(x) (((uint32_t)(x) & MCAN_CCCR_BRSE_MASK) >> MCAN_CCCR_BRSE_SHIFT)

/*
 * FDOE (RW)
 *
 * FD Operation Enable
 * 0= FD operation disabled
 * 1= FD operation enabled
 */
#define MCAN_CCCR_FDOE_MASK (0x100U)
#define MCAN_CCCR_FDOE_SHIFT (8U)
#define MCAN_CCCR_FDOE_SET(x) (((uint32_t)(x) << MCAN_CCCR_FDOE_SHIFT) & MCAN_CCCR_FDOE_MASK)
#define MCAN_CCCR_FDOE_GET(x) (((uint32_t)(x) & MCAN_CCCR_FDOE_MASK) >> MCAN_CCCR_FDOE_SHIFT)

/*
 * TEST (RW)
 *
 * Test Mode Enable
 * 0= Normal operation, register TEST holds reset values
 * 1= Test Mode, write access to register TEST enabled
 */
#define MCAN_CCCR_TEST_MASK (0x80U)
#define MCAN_CCCR_TEST_SHIFT (7U)
#define MCAN_CCCR_TEST_SET(x) (((uint32_t)(x) << MCAN_CCCR_TEST_SHIFT) & MCAN_CCCR_TEST_MASK)
#define MCAN_CCCR_TEST_GET(x) (((uint32_t)(x) & MCAN_CCCR_TEST_MASK) >> MCAN_CCCR_TEST_SHIFT)

/*
 * DAR (RW)
 *
 * Disable Automatic Retransmission
 * 0= Automatic retransmission of messages not transmitted successfully enabled
 * 1= Automatic retransmission disabled
 */
#define MCAN_CCCR_DAR_MASK (0x40U)
#define MCAN_CCCR_DAR_SHIFT (6U)
#define MCAN_CCCR_DAR_SET(x) (((uint32_t)(x) << MCAN_CCCR_DAR_SHIFT) & MCAN_CCCR_DAR_MASK)
#define MCAN_CCCR_DAR_GET(x) (((uint32_t)(x) & MCAN_CCCR_DAR_MASK) >> MCAN_CCCR_DAR_SHIFT)

/*
 * MON (RW)
 *
 * Bus Monitoring Mode
 * Bit MON can only be set by the Host when both CCE and INIT are set to ‘1’. The bit can be reset by the Host at any time.
 * 0= Bus Monitoring Mode is disabled
 * 1= Bus Monitoring Mode is enabled
 */
#define MCAN_CCCR_MON_MASK (0x20U)
#define MCAN_CCCR_MON_SHIFT (5U)
#define MCAN_CCCR_MON_SET(x) (((uint32_t)(x) << MCAN_CCCR_MON_SHIFT) & MCAN_CCCR_MON_MASK)
#define MCAN_CCCR_MON_GET(x) (((uint32_t)(x) & MCAN_CCCR_MON_MASK) >> MCAN_CCCR_MON_SHIFT)

/*
 * CSR (RW)
 *
 * Clock Stop Request
 * 0= No clock stop is requested
 * 1= Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle.
 */
#define MCAN_CCCR_CSR_MASK (0x10U)
#define MCAN_CCCR_CSR_SHIFT (4U)
#define MCAN_CCCR_CSR_SET(x) (((uint32_t)(x) << MCAN_CCCR_CSR_SHIFT) & MCAN_CCCR_CSR_MASK)
#define MCAN_CCCR_CSR_GET(x) (((uint32_t)(x) & MCAN_CCCR_CSR_MASK) >> MCAN_CCCR_CSR_SHIFT)

/*
 * CSA (R)
 *
 * Clock Stop Acknowledge
 * 0= No clock stop acknowledged
 * 1= M_CAN may be set in power down by stopping m_can_hclk and m_can_cclk
 */
#define MCAN_CCCR_CSA_MASK (0x8U)
#define MCAN_CCCR_CSA_SHIFT (3U)
#define MCAN_CCCR_CSA_GET(x) (((uint32_t)(x) & MCAN_CCCR_CSA_MASK) >> MCAN_CCCR_CSA_SHIFT)

/*
 * ASM (RW)
 *
 * Restricted Operation Mode
 * Bit ASM can only be set by the Host when both CCE and INIT are set to ‘1’. The bit can be reset by the Host at any time. For a description of the Restricted Operation Mode see Section 3.1.5.
 * 0= Normal CAN operation
 * 1= Restricted Operation Mode active
 */
#define MCAN_CCCR_ASM_MASK (0x4U)
#define MCAN_CCCR_ASM_SHIFT (2U)
#define MCAN_CCCR_ASM_SET(x) (((uint32_t)(x) << MCAN_CCCR_ASM_SHIFT) & MCAN_CCCR_ASM_MASK)
#define MCAN_CCCR_ASM_GET(x) (((uint32_t)(x) & MCAN_CCCR_ASM_MASK) >> MCAN_CCCR_ASM_SHIFT)

