RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_mcan_regs.h
/*
 * TEFF (RW)
 *
 * Tx Event FIFO Full
 * 0= Tx Event FIFO not full
 * 1= Tx Event FIFO full
 */
#define MCAN_IR_TEFF_MASK (0x4000U)
#define MCAN_IR_TEFF_SHIFT (14U)
#define MCAN_IR_TEFF_SET(x) (((uint32_t)(x) << MCAN_IR_TEFF_SHIFT) & MCAN_IR_TEFF_MASK)
#define MCAN_IR_TEFF_GET(x) (((uint32_t)(x) & MCAN_IR_TEFF_MASK) >> MCAN_IR_TEFF_SHIFT)

/*
 * TEFW (RW)
 *
 * Tx Event FIFO Watermark Reached
 * 0= Tx Event FIFO fill level below watermark
 * 1= Tx Event FIFO fill level reached watermark
 */
#define MCAN_IR_TEFW_MASK (0x2000U)
#define MCAN_IR_TEFW_SHIFT (13U)
#define MCAN_IR_TEFW_SET(x) (((uint32_t)(x) << MCAN_IR_TEFW_SHIFT) & MCAN_IR_TEFW_MASK)
#define MCAN_IR_TEFW_GET(x) (((uint32_t)(x) & MCAN_IR_TEFW_MASK) >> MCAN_IR_TEFW_SHIFT)

/*
 * TEFN (RW)
 *
 * Tx Event FIFO New Entry
 * 0= Tx Event FIFO unchanged
 * 1= Tx Handler wrote Tx Event FIFO element
 */
#define MCAN_IR_TEFN_MASK (0x1000U)
#define MCAN_IR_TEFN_SHIFT (12U)
#define MCAN_IR_TEFN_SET(x) (((uint32_t)(x) << MCAN_IR_TEFN_SHIFT) & MCAN_IR_TEFN_MASK)
#define MCAN_IR_TEFN_GET(x) (((uint32_t)(x) & MCAN_IR_TEFN_MASK) >> MCAN_IR_TEFN_SHIFT)

/*
 * TFE (RW)
 *
 * Tx FIFO Empty
 * 0= Tx FIFO non-empty
 * 1= Tx FIFO empty
 */
#define MCAN_IR_TFE_MASK (0x800U)
#define MCAN_IR_TFE_SHIFT (11U)
#define MCAN_IR_TFE_SET(x) (((uint32_t)(x) << MCAN_IR_TFE_SHIFT) & MCAN_IR_TFE_MASK)
#define MCAN_IR_TFE_GET(x) (((uint32_t)(x) & MCAN_IR_TFE_MASK) >> MCAN_IR_TFE_SHIFT)

/*
 * TCF (RW)
 *
 * Transmission Cancellation Finished
 * 0= No transmission cancellation finished
 * 1= Transmission cancellation finished
 */
#define MCAN_IR_TCF_MASK (0x400U)
#define MCAN_IR_TCF_SHIFT (10U)
#define MCAN_IR_TCF_SET(x) (((uint32_t)(x) << MCAN_IR_TCF_SHIFT) & MCAN_IR_TCF_MASK)
#define MCAN_IR_TCF_GET(x) (((uint32_t)(x) & MCAN_IR_TCF_MASK) >> MCAN_IR_TCF_SHIFT)

/*
 * TC (RW)
 *
 * Transmission Completed
 * 0= No transmission completed
 * 1= Transmission completed
 */
#define MCAN_IR_TC_MASK (0x200U)
#define MCAN_IR_TC_SHIFT (9U)
#define MCAN_IR_TC_SET(x) (((uint32_t)(x) << MCAN_IR_TC_SHIFT) & MCAN_IR_TC_MASK)
#define MCAN_IR_TC_GET(x) (((uint32_t)(x) & MCAN_IR_TC_MASK) >> MCAN_IR_TC_SHIFT)

/*
 * HPM (RW)
 *
 * High Priority Message
 * 0= No high priority message received
 * 1= High priority message received
 */
#define MCAN_IR_HPM_MASK (0x100U)
#define MCAN_IR_HPM_SHIFT (8U)
#define MCAN_IR_HPM_SET(x) (((uint32_t)(x) << MCAN_IR_HPM_SHIFT) & MCAN_IR_HPM_MASK)
#define MCAN_IR_HPM_GET(x) (((uint32_t)(x) & MCAN_IR_HPM_MASK) >> MCAN_IR_HPM_SHIFT)

/*
 * RF1L (RW)
 *
 * Rx FIFO 1 Message Lost
 * 0= No Rx FIFO 1 message lost
 * 1= Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero
 */
#define MCAN_IR_RF1L_MASK (0x80U)
#define MCAN_IR_RF1L_SHIFT (7U)
#define MCAN_IR_RF1L_SET(x) (((uint32_t)(x) << MCAN_IR_RF1L_SHIFT) & MCAN_IR_RF1L_MASK)
#define MCAN_IR_RF1L_GET(x) (((uint32_t)(x) & MCAN_IR_RF1L_MASK) >> MCAN_IR_RF1L_SHIFT)

/*
 * RF1F (RW)
 *
 * Rx FIFO 1 Full
 * 0= Rx FIFO 1 not full
 * 1= Rx FIFO 1 full
 */
#define MCAN_IR_RF1F_MASK (0x40U)
#define MCAN_IR_RF1F_SHIFT (6U)
#define MCAN_IR_RF1F_SET(x) (((uint32_t)(x) << MCAN_IR_RF1F_SHIFT) & MCAN_IR_RF1F_MASK)
#define MCAN_IR_RF1F_GET(x) (((uint32_t)(x) & MCAN_IR_RF1F_MASK) >> MCAN_IR_RF1F_SHIFT)

/*
 * RF1W (RW)
 *
 * Rx FIFO 1 Watermark Reached
 * 0= Rx FIFO 1 fill level below watermark
 * 1= Rx FIFO 1 fill level reached watermark
 */
#define MCAN_IR_RF1W_MASK (0x20U)
#define MCAN_IR_RF1W_SHIFT (5U)
#define MCAN_IR_RF1W_SET(x) (((uint32_t)(x) << MCAN_IR_RF1W_SHIFT) & MCAN_IR_RF1W_MASK)
#define MCAN_IR_RF1W_GET(x) (((uint32_t)(x) & MCAN_IR_RF1W_MASK) >> MCAN_IR_RF1W_SHIFT)

/*
 * RF1N (RW)
 *
 * Rx FIFO 1 New Message
 * 0= No new message written to Rx FIFO 1
 * 1= New message written to Rx FIFO 1
 */
#define MCAN_IR_RF1N_MASK (0x10U)
#define MCAN_IR_RF1N_SHIFT (4U)
#define MCAN_IR_RF1N_SET(x) (((uint32_t)(x) << MCAN_IR_RF1N_SHIFT) & MCAN_IR_RF1N_MASK)
#define MCAN_IR_RF1N_GET(x) (((uint32_t)(x) & MCAN_IR_RF1N_MASK) >> MCAN_IR_RF1N_SHIFT)

/*
 * RF0L (RW)
 *
 * Rx FIFO 0 Message Lost
 * 0= No Rx FIFO 0 message lost
 * 1= Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero
 */
#define MCAN_IR_RF0L_MASK (0x8U)
#define MCAN_IR_RF0L_SHIFT (3U)
#define MCAN_IR_RF0L_SET(x) (((uint32_t)(x) << MCAN_IR_RF0L_SHIFT) & MCAN_IR_RF0L_MASK)
#define MCAN_IR_RF0L_GET(x) (((uint32_t)(x) & MCAN_IR_RF0L_MASK) >> MCAN_IR_RF0L_SHIFT)

/*
 * RF0F (RW)
 *
 * Rx FIFO 0 Full
 * 0= Rx FIFO 0 not full
 * 1= Rx FIFO 0 full
 */
#define MCAN_IR_RF0F_MASK (0x4U)
#define MCAN_IR_RF0F_SHIFT (2U)
#define MCAN_IR_RF0F_SET(x) (((uint32_t)(x) << MCAN_IR_RF0F_SHIFT) & MCAN_IR_RF0F_MASK)
#define MCAN_IR_RF0F_GET(x) (((uint32_t)(x) & MCAN_IR_RF0F_MASK) >> MCAN_IR_RF0F_SHIFT)

/*
 * RF0W (RW)
 *
 * Rx FIFO 0 Watermark Reached
 * 0= Rx FIFO 0 fill level below watermark
 * 1= Rx FIFO 0 fill level reached watermark
 */
#define MCAN_IR_RF0W_MASK (0x2U)
#define MCAN_IR_RF0W_SHIFT (1U)
#define MCAN_IR_RF0W_SET(x) (((uint32_t)(x) << MCAN_IR_RF0W_SHIFT) & MCAN_IR_RF0W_MASK)
#define MCAN_IR_RF0W_GET(x) (((uint32_t)(x) & MCAN_IR_RF0W_MASK) >> MCAN_IR_RF0W_SHIFT)

/*
 * RF0N (RW)
 *
 * Rx FIFO 0 New Message
 * 0= No new message written to Rx FIFO 0
 * 1= New message written to Rx FIFO 0
 */
#define MCAN_IR_RF0N_MASK (0x1U)
#define MCAN_IR_RF0N_SHIFT (0U)
#define MCAN_IR_RF0N_SET(x) (((uint32_t)(x) << MCAN_IR_RF0N_SHIFT) & MCAN_IR_RF0N_MASK)
#define MCAN_IR_RF0N_GET(x) (((uint32_t)(x) & MCAN_IR_RF0N_MASK) >> MCAN_IR_RF0N_SHIFT)

/* Bitfield definition for register: IE */
/*
 * ARAE (RW)
 *
 * Access to Reserved Address Enable
 */
#define MCAN_IE_ARAE_MASK (0x20000000UL)
#define MCAN_IE_ARAE_SHIFT (29U)
#define MCAN_IE_ARAE_SET(x) (((uint32_t)(x) << MCAN_IE_ARAE_SHIFT) & MCAN_IE_ARAE_MASK)
#define MCAN_IE_ARAE_GET(x) (((uint32_t)(x) & MCAN_IE_ARAE_MASK) >> MCAN_IE_ARAE_SHIFT)

/*
 * PEDE (RW)
 *
 * Protocol Error in Data Phase Enable
 */
#define MCAN_IE_PEDE_MASK (0x10000000UL)
#define MCAN_IE_PEDE_SHIFT (28U)
#define MCAN_IE_PEDE_SET(x) (((uint32_t)(x) << MCAN_IE_PEDE_SHIFT) & MCAN_IE_PEDE_MASK)
#define MCAN_IE_PEDE_GET(x) (((uint32_t)(x) & MCAN_IE_PEDE_MASK) >> MCAN_IE_PEDE_SHIFT)

