RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_mcan_regs.h
/*
 * PEAE (RW)
 *
 * Protocol Error in Arbitration Phase Enable
 */
#define MCAN_IE_PEAE_MASK (0x8000000UL)
#define MCAN_IE_PEAE_SHIFT (27U)
#define MCAN_IE_PEAE_SET(x) (((uint32_t)(x) << MCAN_IE_PEAE_SHIFT) & MCAN_IE_PEAE_MASK)
#define MCAN_IE_PEAE_GET(x) (((uint32_t)(x) & MCAN_IE_PEAE_MASK) >> MCAN_IE_PEAE_SHIFT)

/*
 * WDIE (RW)
 *
 * Watchdog Interrupt Enable
 */
#define MCAN_IE_WDIE_MASK (0x4000000UL)
#define MCAN_IE_WDIE_SHIFT (26U)
#define MCAN_IE_WDIE_SET(x) (((uint32_t)(x) << MCAN_IE_WDIE_SHIFT) & MCAN_IE_WDIE_MASK)
#define MCAN_IE_WDIE_GET(x) (((uint32_t)(x) & MCAN_IE_WDIE_MASK) >> MCAN_IE_WDIE_SHIFT)

/*
 * BOE (RW)
 *
 * Bus_Off Status Interrupt Enable
 */
#define MCAN_IE_BOE_MASK (0x2000000UL)
#define MCAN_IE_BOE_SHIFT (25U)
#define MCAN_IE_BOE_SET(x) (((uint32_t)(x) << MCAN_IE_BOE_SHIFT) & MCAN_IE_BOE_MASK)
#define MCAN_IE_BOE_GET(x) (((uint32_t)(x) & MCAN_IE_BOE_MASK) >> MCAN_IE_BOE_SHIFT)

/*
 * EWE (RW)
 *
 * Warning Status Interrupt Enable
 */
#define MCAN_IE_EWE_MASK (0x1000000UL)
#define MCAN_IE_EWE_SHIFT (24U)
#define MCAN_IE_EWE_SET(x) (((uint32_t)(x) << MCAN_IE_EWE_SHIFT) & MCAN_IE_EWE_MASK)
#define MCAN_IE_EWE_GET(x) (((uint32_t)(x) & MCAN_IE_EWE_MASK) >> MCAN_IE_EWE_SHIFT)

/*
 * EPE (RW)
 *
 * Error Passive Interrupt Enable
 */
#define MCAN_IE_EPE_MASK (0x800000UL)
#define MCAN_IE_EPE_SHIFT (23U)
#define MCAN_IE_EPE_SET(x) (((uint32_t)(x) << MCAN_IE_EPE_SHIFT) & MCAN_IE_EPE_MASK)
#define MCAN_IE_EPE_GET(x) (((uint32_t)(x) & MCAN_IE_EPE_MASK) >> MCAN_IE_EPE_SHIFT)

/*
 * ELOE (RW)
 *
 * Error Logging Overflow Interrupt Enable
 */
#define MCAN_IE_ELOE_MASK (0x400000UL)
#define MCAN_IE_ELOE_SHIFT (22U)
#define MCAN_IE_ELOE_SET(x) (((uint32_t)(x) << MCAN_IE_ELOE_SHIFT) & MCAN_IE_ELOE_MASK)
#define MCAN_IE_ELOE_GET(x) (((uint32_t)(x) & MCAN_IE_ELOE_MASK) >> MCAN_IE_ELOE_SHIFT)

/*
 * BEUE (RW)
 *
 * Bit Error Uncorrected Interrupt Enable
 */
#define MCAN_IE_BEUE_MASK (0x200000UL)
#define MCAN_IE_BEUE_SHIFT (21U)
#define MCAN_IE_BEUE_SET(x) (((uint32_t)(x) << MCAN_IE_BEUE_SHIFT) & MCAN_IE_BEUE_MASK)
#define MCAN_IE_BEUE_GET(x) (((uint32_t)(x) & MCAN_IE_BEUE_MASK) >> MCAN_IE_BEUE_SHIFT)

/*
 * BECE (RW)
 *
 * Bit Error Corrected Interrupt Enable
 */
#define MCAN_IE_BECE_MASK (0x100000UL)
#define MCAN_IE_BECE_SHIFT (20U)
#define MCAN_IE_BECE_SET(x) (((uint32_t)(x) << MCAN_IE_BECE_SHIFT) & MCAN_IE_BECE_MASK)
#define MCAN_IE_BECE_GET(x) (((uint32_t)(x) & MCAN_IE_BECE_MASK) >> MCAN_IE_BECE_SHIFT)

/*
 * DRXE (RW)
 *
 * Message stored to Dedicated Rx Buffer Interrupt Enable
 */
#define MCAN_IE_DRXE_MASK (0x80000UL)
#define MCAN_IE_DRXE_SHIFT (19U)
#define MCAN_IE_DRXE_SET(x) (((uint32_t)(x) << MCAN_IE_DRXE_SHIFT) & MCAN_IE_DRXE_MASK)
#define MCAN_IE_DRXE_GET(x) (((uint32_t)(x) & MCAN_IE_DRXE_MASK) >> MCAN_IE_DRXE_SHIFT)

/*
 * TOOE (RW)
 *
 * Timeout Occurred Interrupt Enable
 */
#define MCAN_IE_TOOE_MASK (0x40000UL)
#define MCAN_IE_TOOE_SHIFT (18U)
#define MCAN_IE_TOOE_SET(x) (((uint32_t)(x) << MCAN_IE_TOOE_SHIFT) & MCAN_IE_TOOE_MASK)
#define MCAN_IE_TOOE_GET(x) (((uint32_t)(x) & MCAN_IE_TOOE_MASK) >> MCAN_IE_TOOE_SHIFT)

/*
 * MRAFE (RW)
 *
 * Message RAM Access Failure Interrupt Enable
 */
#define MCAN_IE_MRAFE_MASK (0x20000UL)
#define MCAN_IE_MRAFE_SHIFT (17U)
#define MCAN_IE_MRAFE_SET(x) (((uint32_t)(x) << MCAN_IE_MRAFE_SHIFT) & MCAN_IE_MRAFE_MASK)
#define MCAN_IE_MRAFE_GET(x) (((uint32_t)(x) & MCAN_IE_MRAFE_MASK) >> MCAN_IE_MRAFE_SHIFT)

/*
 * TSWE (RW)
 *
 * Timestamp Wraparound Interrupt Enable
 */
#define MCAN_IE_TSWE_MASK (0x10000UL)
#define MCAN_IE_TSWE_SHIFT (16U)
#define MCAN_IE_TSWE_SET(x) (((uint32_t)(x) << MCAN_IE_TSWE_SHIFT) & MCAN_IE_TSWE_MASK)
#define MCAN_IE_TSWE_GET(x) (((uint32_t)(x) & MCAN_IE_TSWE_MASK) >> MCAN_IE_TSWE_SHIFT)

/*
 * TEFLE (RW)
 *
 * Tx Event FIFO Event Lost Interrupt Enable
 */
#define MCAN_IE_TEFLE_MASK (0x8000U)
#define MCAN_IE_TEFLE_SHIFT (15U)
#define MCAN_IE_TEFLE_SET(x) (((uint32_t)(x) << MCAN_IE_TEFLE_SHIFT) & MCAN_IE_TEFLE_MASK)
#define MCAN_IE_TEFLE_GET(x) (((uint32_t)(x) & MCAN_IE_TEFLE_MASK) >> MCAN_IE_TEFLE_SHIFT)

/*
 * TEFFE (RW)
 *
 * Tx Event FIFO Full Interrupt Enable
 */
#define MCAN_IE_TEFFE_MASK (0x4000U)
#define MCAN_IE_TEFFE_SHIFT (14U)
#define MCAN_IE_TEFFE_SET(x) (((uint32_t)(x) << MCAN_IE_TEFFE_SHIFT) & MCAN_IE_TEFFE_MASK)
#define MCAN_IE_TEFFE_GET(x) (((uint32_t)(x) & MCAN_IE_TEFFE_MASK) >> MCAN_IE_TEFFE_SHIFT)

/*
 * TEFWE (RW)
 *
 * Tx Event FIFO Watermark Reached Interrupt Enable
 */
#define MCAN_IE_TEFWE_MASK (0x2000U)
#define MCAN_IE_TEFWE_SHIFT (13U)
#define MCAN_IE_TEFWE_SET(x) (((uint32_t)(x) << MCAN_IE_TEFWE_SHIFT) & MCAN_IE_TEFWE_MASK)
#define MCAN_IE_TEFWE_GET(x) (((uint32_t)(x) & MCAN_IE_TEFWE_MASK) >> MCAN_IE_TEFWE_SHIFT)

/*
 * TEFNE (RW)
 *
 * Tx Event FIFO New Entry Interrupt Enable
 */
#define MCAN_IE_TEFNE_MASK (0x1000U)
#define MCAN_IE_TEFNE_SHIFT (12U)
#define MCAN_IE_TEFNE_SET(x) (((uint32_t)(x) << MCAN_IE_TEFNE_SHIFT) & MCAN_IE_TEFNE_MASK)
#define MCAN_IE_TEFNE_GET(x) (((uint32_t)(x) & MCAN_IE_TEFNE_MASK) >> MCAN_IE_TEFNE_SHIFT)

/*
 * TFEE (RW)
 *
 * Tx FIFO Empty Interrupt Enable
 */
#define MCAN_IE_TFEE_MASK (0x800U)
#define MCAN_IE_TFEE_SHIFT (11U)
#define MCAN_IE_TFEE_SET(x) (((uint32_t)(x) << MCAN_IE_TFEE_SHIFT) & MCAN_IE_TFEE_MASK)
#define MCAN_IE_TFEE_GET(x) (((uint32_t)(x) & MCAN_IE_TFEE_MASK) >> MCAN_IE_TFEE_SHIFT)

/*
 * TCFE (RW)
 *
 * Transmission Cancellation Finished Interrupt Enable
 */
#define MCAN_IE_TCFE_MASK (0x400U)
#define MCAN_IE_TCFE_SHIFT (10U)
#define MCAN_IE_TCFE_SET(x) (((uint32_t)(x) << MCAN_IE_TCFE_SHIFT) & MCAN_IE_TCFE_MASK)
#define MCAN_IE_TCFE_GET(x) (((uint32_t)(x) & MCAN_IE_TCFE_MASK) >> MCAN_IE_TCFE_SHIFT)

/*
 * TCE (RW)
 *
 * Transmission Completed Interrupt Enable
 */
#define MCAN_IE_TCE_MASK (0x200U)
#define MCAN_IE_TCE_SHIFT (9U)
#define MCAN_IE_TCE_SET(x) (((uint32_t)(x) << MCAN_IE_TCE_SHIFT) & MCAN_IE_TCE_MASK)
#define MCAN_IE_TCE_GET(x) (((uint32_t)(x) & MCAN_IE_TCE_MASK) >> MCAN_IE_TCE_SHIFT)

/*
 * HPME (RW)
 *
 * High Priority Message Interrupt Enable
 */
#define MCAN_IE_HPME_MASK (0x100U)
#define MCAN_IE_HPME_SHIFT (8U)
#define MCAN_IE_HPME_SET(x) (((uint32_t)(x) << MCAN_IE_HPME_SHIFT) & MCAN_IE_HPME_MASK)
#define MCAN_IE_HPME_GET(x) (((uint32_t)(x) & MCAN_IE_HPME_MASK) >> MCAN_IE_HPME_SHIFT)

