RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_mcan_regs.h
/* TS_SEL register group index macro definition */
#define MCAN_TS_SEL_TS_SEL0 (0UL)
#define MCAN_TS_SEL_TS_SEL1 (1UL)
#define MCAN_TS_SEL_TS_SEL2 (2UL)
#define MCAN_TS_SEL_TS_SEL3 (3UL)
#define MCAN_TS_SEL_TS_SEL4 (4UL)
#define MCAN_TS_SEL_TS_SEL5 (5UL)
#define MCAN_TS_SEL_TS_SEL6 (6UL)
#define MCAN_TS_SEL_TS_SEL7 (7UL)
#define MCAN_TS_SEL_TS_SEL8 (8UL)
#define MCAN_TS_SEL_TS_SEL9 (9UL)
#define MCAN_TS_SEL_TS_SEL10 (10UL)
#define MCAN_TS_SEL_TS_SEL11 (11UL)
#define MCAN_TS_SEL_TS_SEL12 (12UL)
#define MCAN_TS_SEL_TS_SEL13 (13UL)
#define MCAN_TS_SEL_TS_SEL14 (14UL)
#define MCAN_TS_SEL_TS_SEL15 (15UL)

/* MESSAGE_BUFF register group index macro definition */
#define MCAN_MESSAGE_BUFF_0 (0UL)
#define MCAN_MESSAGE_BUFF_1 (1UL)
#define MCAN_MESSAGE_BUFF_2 (2UL)
#define MCAN_MESSAGE_BUFF_3 (3UL)
#define MCAN_MESSAGE_BUFF_4 (4UL)
#define MCAN_MESSAGE_BUFF_5 (5UL)
#define MCAN_MESSAGE_BUFF_6 (6UL)
#define MCAN_MESSAGE_BUFF_7 (7UL)
#define MCAN_MESSAGE_BUFF_8 (8UL)
#define MCAN_MESSAGE_BUFF_9 (9UL)
#define MCAN_MESSAGE_BUFF_10 (10UL)
#define MCAN_MESSAGE_BUFF_11 (11UL)
#define MCAN_MESSAGE_BUFF_12 (12UL)
#define MCAN_MESSAGE_BUFF_13 (13UL)
#define MCAN_MESSAGE_BUFF_14 (14UL)
#define MCAN_MESSAGE_BUFF_15 (15UL)
#define MCAN_MESSAGE_BUFF_16 (16UL)
#define MCAN_MESSAGE_BUFF_17 (17UL)
#define MCAN_MESSAGE_BUFF_18 (18UL)
#define MCAN_MESSAGE_BUFF_19 (19UL)
#define MCAN_MESSAGE_BUFF_20 (20UL)
#define MCAN_MESSAGE_BUFF_21 (21UL)
#define MCAN_MESSAGE_BUFF_22 (22UL)
#define MCAN_MESSAGE_BUFF_23 (23UL)
#define MCAN_MESSAGE_BUFF_24 (24UL)
#define MCAN_MESSAGE_BUFF_25 (25UL)
#define MCAN_MESSAGE_BUFF_26 (26UL)
#define MCAN_MESSAGE_BUFF_27 (27UL)
#define MCAN_MESSAGE_BUFF_28 (28UL)
#define MCAN_MESSAGE_BUFF_29 (29UL)
#define MCAN_MESSAGE_BUFF_30 (30UL)
#define MCAN_MESSAGE_BUFF_31 (31UL)
#define MCAN_MESSAGE_BUFF_32 (32UL)
#define MCAN_MESSAGE_BUFF_33 (33UL)
#define MCAN_MESSAGE_BUFF_34 (34UL)
#define MCAN_MESSAGE_BUFF_35 (35UL)
#define MCAN_MESSAGE_BUFF_36 (36UL)
#define MCAN_MESSAGE_BUFF_37 (37UL)
#define MCAN_MESSAGE_BUFF_38 (38UL)
#define MCAN_MESSAGE_BUFF_39 (39UL)
#define MCAN_MESSAGE_BUFF_40 (40UL)
#define MCAN_MESSAGE_BUFF_41 (41UL)
#define MCAN_MESSAGE_BUFF_42 (42UL)
#define MCAN_MESSAGE_BUFF_43 (43UL)
#define MCAN_MESSAGE_BUFF_44 (44UL)
#define MCAN_MESSAGE_BUFF_45 (45UL)
#define MCAN_MESSAGE_BUFF_46 (46UL)
#define MCAN_MESSAGE_BUFF_47 (47UL)
#define MCAN_MESSAGE_BUFF_48 (48UL)
#define MCAN_MESSAGE_BUFF_49 (49UL)
#define MCAN_MESSAGE_BUFF_50 (50UL)
#define MCAN_MESSAGE_BUFF_51 (51UL)
#define MCAN_MESSAGE_BUFF_52 (52UL)
#define MCAN_MESSAGE_BUFF_53 (53UL)
#define MCAN_MESSAGE_BUFF_54 (54UL)
#define MCAN_MESSAGE_BUFF_55 (55UL)
#define MCAN_MESSAGE_BUFF_56 (56UL)
#define MCAN_MESSAGE_BUFF_57 (57UL)
#define MCAN_MESSAGE_BUFF_58 (58UL)
#define MCAN_MESSAGE_BUFF_59 (59UL)
#define MCAN_MESSAGE_BUFF_60 (60UL)
#define MCAN_MESSAGE_BUFF_61 (61UL)
#define MCAN_MESSAGE_BUFF_62 (62UL)
#define MCAN_MESSAGE_BUFF_63 (63UL)
#define MCAN_MESSAGE_BUFF_64 (64UL)
#define MCAN_MESSAGE_BUFF_65 (65UL)
#define MCAN_MESSAGE_BUFF_66 (66UL)
#define MCAN_MESSAGE_BUFF_67 (67UL)
#define MCAN_MESSAGE_BUFF_68 (68UL)
#define MCAN_MESSAGE_BUFF_69 (69UL)
#define MCAN_MESSAGE_BUFF_70 (70UL)
#define MCAN_MESSAGE_BUFF_71 (71UL)
#define MCAN_MESSAGE_BUFF_72 (72UL)
#define MCAN_MESSAGE_BUFF_73 (73UL)
#define MCAN_MESSAGE_BUFF_74 (74UL)
#define MCAN_MESSAGE_BUFF_75 (75UL)
#define MCAN_MESSAGE_BUFF_76 (76UL)
#define MCAN_MESSAGE_BUFF_77 (77UL)
#define MCAN_MESSAGE_BUFF_78 (78UL)
#define MCAN_MESSAGE_BUFF_79 (79UL)
#define MCAN_MESSAGE_BUFF_80 (80UL)
#define MCAN_MESSAGE_BUFF_81 (81UL)
#define MCAN_MESSAGE_BUFF_82 (82UL)
#define MCAN_MESSAGE_BUFF_83 (83UL)
#define MCAN_MESSAGE_BUFF_84 (84UL)
#define MCAN_MESSAGE_BUFF_85 (85UL)
#define MCAN_MESSAGE_BUFF_86 (86UL)
#define MCAN_MESSAGE_BUFF_87 (87UL)
#define MCAN_MESSAGE_BUFF_88 (88UL)
#define MCAN_MESSAGE_BUFF_89 (89UL)
#define MCAN_MESSAGE_BUFF_90 (90UL)
#define MCAN_MESSAGE_BUFF_91 (91UL)
#define MCAN_MESSAGE_BUFF_92 (92UL)
#define MCAN_MESSAGE_BUFF_93 (93UL)
#define MCAN_MESSAGE_BUFF_94 (94UL)
#define MCAN_MESSAGE_BUFF_95 (95UL)
#define MCAN_MESSAGE_BUFF_96 (96UL)
#define MCAN_MESSAGE_BUFF_97 (97UL)
#define MCAN_MESSAGE_BUFF_98 (98UL)
#define MCAN_MESSAGE_BUFF_99 (99UL)
#define MCAN_MESSAGE_BUFF_100 (100UL)
#define MCAN_MESSAGE_BUFF_101 (101UL)
#define MCAN_MESSAGE_BUFF_102 (102UL)
#define MCAN_MESSAGE_BUFF_103 (103UL)
#define MCAN_MESSAGE_BUFF_104 (104UL)
#define MCAN_MESSAGE_BUFF_105 (105UL)
#define MCAN_MESSAGE_BUFF_106 (106UL)
#define MCAN_MESSAGE_BUFF_107 (107UL)
#define MCAN_MESSAGE_BUFF_108 (108UL)
#define MCAN_MESSAGE_BUFF_109 (109UL)
#define MCAN_MESSAGE_BUFF_110 (110UL)
#define MCAN_MESSAGE_BUFF_111 (111UL)
#define MCAN_MESSAGE_BUFF_112 (112UL)
#define MCAN_MESSAGE_BUFF_113 (113UL)
#define MCAN_MESSAGE_BUFF_114 (114UL)
#define MCAN_MESSAGE_BUFF_115 (115UL)
#define MCAN_MESSAGE_BUFF_116 (116UL)
#define MCAN_MESSAGE_BUFF_117 (117UL)
#define MCAN_MESSAGE_BUFF_118 (118UL)
#define MCAN_MESSAGE_BUFF_119 (119UL)
#define MCAN_MESSAGE_BUFF_120 (120UL)
#define MCAN_MESSAGE_BUFF_121 (121UL)
#define MCAN_MESSAGE_BUFF_122 (122UL)
#define MCAN_MESSAGE_BUFF_123 (123UL)
#define MCAN_MESSAGE_BUFF_124 (124UL)
#define MCAN_MESSAGE_BUFF_125 (125UL)
#define MCAN_MESSAGE_BUFF_126 (126UL)
#define MCAN_MESSAGE_BUFF_127 (127UL)
#define MCAN_MESSAGE_BUFF_128 (128UL)
#define MCAN_MESSAGE_BUFF_129 (129UL)
#define MCAN_MESSAGE_BUFF_130 (130UL)
#define MCAN_MESSAGE_BUFF_131 (131UL)
#define MCAN_MESSAGE_BUFF_132 (132UL)
#define MCAN_MESSAGE_BUFF_133 (133UL)
#define MCAN_MESSAGE_BUFF_134 (134UL)
#define MCAN_MESSAGE_BUFF_135 (135UL)
#define MCAN_MESSAGE_BUFF_136 (136UL)
#define MCAN_MESSAGE_BUFF_137 (137UL)
#define MCAN_MESSAGE_BUFF_138 (138UL)
#define MCAN_MESSAGE_BUFF_139 (139UL)
#define MCAN_MESSAGE_BUFF_140 (140UL)
#define MCAN_MESSAGE_BUFF_141 (141UL)
#define MCAN_MESSAGE_BUFF_142 (142UL)
#define MCAN_MESSAGE_BUFF_143 (143UL)
#define MCAN_MESSAGE_BUFF_144 (144UL)
#define MCAN_MESSAGE_BUFF_145 (145UL)
#define MCAN_MESSAGE_BUFF_146 (146UL)
#define MCAN_MESSAGE_BUFF_147 (147UL)
#define MCAN_MESSAGE_BUFF_148 (148UL)
#define MCAN_MESSAGE_BUFF_149 (149UL)
#define MCAN_MESSAGE_BUFF_150 (150UL)
#define MCAN_MESSAGE_BUFF_151 (151UL)
#define MCAN_MESSAGE_BUFF_152 (152UL)
#define MCAN_MESSAGE_BUFF_153 (153UL)
#define MCAN_MESSAGE_BUFF_154 (154UL)
#define MCAN_MESSAGE_BUFF_155 (155UL)
#define MCAN_MESSAGE_BUFF_156 (156UL)
#define MCAN_MESSAGE_BUFF_157 (157UL)
#define MCAN_MESSAGE_BUFF_158 (158UL)
#define MCAN_MESSAGE_BUFF_159 (159UL)
#define MCAN_MESSAGE_BUFF_160 (160UL)
#define MCAN_MESSAGE_BUFF_161 (161UL)
#define MCAN_MESSAGE_BUFF_162 (162UL)
#define MCAN_MESSAGE_BUFF_163 (163UL)
#define MCAN_MESSAGE_BUFF_164 (164UL)
#define MCAN_MESSAGE_BUFF_165 (165UL)
#define MCAN_MESSAGE_BUFF_166 (166UL)
#define MCAN_MESSAGE_BUFF_167 (167UL)
#define MCAN_MESSAGE_BUFF_168 (168UL)
#define MCAN_MESSAGE_BUFF_169 (169UL)
#define MCAN_MESSAGE_BUFF_170 (170UL)
#define MCAN_MESSAGE_BUFF_171 (171UL)
#define MCAN_MESSAGE_BUFF_172 (172UL)
#define MCAN_MESSAGE_BUFF_173 (173UL)
#define MCAN_MESSAGE_BUFF_174 (174UL)
#define MCAN_MESSAGE_BUFF_175 (175UL)
#define MCAN_MESSAGE_BUFF_176 (176UL)
#define MCAN_MESSAGE_BUFF_177 (177UL)
#define MCAN_MESSAGE_BUFF_178 (178UL)
#define MCAN_MESSAGE_BUFF_179 (179UL)
#define MCAN_MESSAGE_BUFF_180 (180UL)
#define MCAN_MESSAGE_BUFF_181 (181UL)
#define MCAN_MESSAGE_BUFF_182 (182UL)
#define MCAN_MESSAGE_BUFF_183 (183UL)
#define MCAN_MESSAGE_BUFF_184 (184UL)
#define MCAN_MESSAGE_BUFF_185 (185UL)
#define MCAN_MESSAGE_BUFF_186 (186UL)
#define MCAN_MESSAGE_BUFF_187 (187UL)
#define MCAN_MESSAGE_BUFF_188 (188UL)
#define MCAN_MESSAGE_BUFF_189 (189UL)
#define MCAN_MESSAGE_BUFF_190 (190UL)
#define MCAN_MESSAGE_BUFF_191 (191UL)
#define MCAN_MESSAGE_BUFF_192 (192UL)
#define MCAN_MESSAGE_BUFF_193 (193UL)
#define MCAN_MESSAGE_BUFF_194 (194UL)
#define MCAN_MESSAGE_BUFF_195 (195UL)
#define MCAN_MESSAGE_BUFF_196 (196UL)
#define MCAN_MESSAGE_BUFF_197 (197UL)
#define MCAN_MESSAGE_BUFF_198 (198UL)
#define MCAN_MESSAGE_BUFF_199 (199UL)
#define MCAN_MESSAGE_BUFF_200 (200UL)
#define MCAN_MESSAGE_BUFF_201 (201UL)
#define MCAN_MESSAGE_BUFF_202 (202UL)
#define MCAN_MESSAGE_BUFF_203 (203UL)
#define MCAN_MESSAGE_BUFF_204 (204UL)
#define MCAN_MESSAGE_BUFF_205 (205UL)
#define MCAN_MESSAGE_BUFF_206 (206UL)
#define MCAN_MESSAGE_BUFF_207 (207UL)
#define MCAN_MESSAGE_BUFF_208 (208UL)
#define MCAN_MESSAGE_BUFF_209 (209UL)
#define MCAN_MESSAGE_BUFF_210 (210UL)
#define MCAN_MESSAGE_BUFF_211 (211UL)
#define MCAN_MESSAGE_BUFF_212 (212UL)
#define MCAN_MESSAGE_BUFF_213 (213UL)
#define MCAN_MESSAGE_BUFF_214 (214UL)
#define MCAN_MESSAGE_BUFF_215 (215UL)
#define MCAN_MESSAGE_BUFF_216 (216UL)
#define MCAN_MESSAGE_BUFF_217 (217UL)
#define MCAN_MESSAGE_BUFF_218 (218UL)
#define MCAN_MESSAGE_BUFF_219 (219UL)
#define MCAN_MESSAGE_BUFF_220 (220UL)
#define MCAN_MESSAGE_BUFF_221 (221UL)
#define MCAN_MESSAGE_BUFF_222 (222UL)
#define MCAN_MESSAGE_BUFF_223 (223UL)
#define MCAN_MESSAGE_BUFF_224 (224UL)
#define MCAN_MESSAGE_BUFF_225 (225UL)
#define MCAN_MESSAGE_BUFF_226 (226UL)
#define MCAN_MESSAGE_BUFF_227 (227UL)
#define MCAN_MESSAGE_BUFF_228 (228UL)
#define MCAN_MESSAGE_BUFF_229 (229UL)
#define MCAN_MESSAGE_BUFF_230 (230UL)
#define MCAN_MESSAGE_BUFF_231 (231UL)
#define MCAN_MESSAGE_BUFF_232 (232UL)
#define MCAN_MESSAGE_BUFF_233 (233UL)
#define MCAN_MESSAGE_BUFF_234 (234UL)
#define MCAN_MESSAGE_BUFF_235 (235UL)
#define MCAN_MESSAGE_BUFF_236 (236UL)
#define MCAN_MESSAGE_BUFF_237 (237UL)
#define MCAN_MESSAGE_BUFF_238 (238UL)
#define MCAN_MESSAGE_BUFF_239 (239UL)
#define MCAN_MESSAGE_BUFF_240 (240UL)
#define MCAN_MESSAGE_BUFF_241 (241UL)
#define MCAN_MESSAGE_BUFF_242 (242UL)
#define MCAN_MESSAGE_BUFF_243 (243UL)
#define MCAN_MESSAGE_BUFF_244 (244UL)
#define MCAN_MESSAGE_BUFF_245 (245UL)
#define MCAN_MESSAGE_BUFF_246 (246UL)
#define MCAN_MESSAGE_BUFF_247 (247UL)
#define MCAN_MESSAGE_BUFF_248 (248UL)
#define MCAN_MESSAGE_BUFF_249 (249UL)
#define MCAN_MESSAGE_BUFF_250 (250UL)
#define MCAN_MESSAGE_BUFF_251 (251UL)
#define MCAN_MESSAGE_BUFF_252 (252UL)
#define MCAN_MESSAGE_BUFF_253 (253UL)
#define MCAN_MESSAGE_BUFF_254 (254UL)
#define MCAN_MESSAGE_BUFF_255 (255UL)
#define MCAN_MESSAGE_BUFF_256 (256UL)
#define MCAN_MESSAGE_BUFF_257 (257UL)
#define MCAN_MESSAGE_BUFF_258 (258UL)
#define MCAN_MESSAGE_BUFF_259 (259UL)
#define MCAN_MESSAGE_BUFF_260 (260UL)
#define MCAN_MESSAGE_BUFF_261 (261UL)
#define MCAN_MESSAGE_BUFF_262 (262UL)
#define MCAN_MESSAGE_BUFF_263 (263UL)
#define MCAN_MESSAGE_BUFF_264 (264UL)
#define MCAN_MESSAGE_BUFF_265 (265UL)
#define MCAN_MESSAGE_BUFF_266 (266UL)
#define MCAN_MESSAGE_BUFF_267 (267UL)
#define MCAN_MESSAGE_BUFF_268 (268UL)
#define MCAN_MESSAGE_BUFF_269 (269UL)
#define MCAN_MESSAGE_BUFF_270 (270UL)
#define MCAN_MESSAGE_BUFF_271 (271UL)
#define MCAN_MESSAGE_BUFF_272 (272UL)
#define MCAN_MESSAGE_BUFF_273 (273UL)
#define MCAN_MESSAGE_BUFF_274 (274UL)
#define MCAN_MESSAGE_BUFF_275 (275UL)
#define MCAN_MESSAGE_BUFF_276 (276UL)
#define MCAN_MESSAGE_BUFF_277 (277UL)
#define MCAN_MESSAGE_BUFF_278 (278UL)
#define MCAN_MESSAGE_BUFF_279 (279UL)
#define MCAN_MESSAGE_BUFF_280 (280UL)
#define MCAN_MESSAGE_BUFF_281 (281UL)
#define MCAN_MESSAGE_BUFF_282 (282UL)
#define MCAN_MESSAGE_BUFF_283 (283UL)
#define MCAN_MESSAGE_BUFF_284 (284UL)
#define MCAN_MESSAGE_BUFF_285 (285UL)
#define MCAN_MESSAGE_BUFF_286 (286UL)
#define MCAN_MESSAGE_BUFF_287 (287UL)
#define MCAN_MESSAGE_BUFF_288 (288UL)
#define MCAN_MESSAGE_BUFF_289 (289UL)
#define MCAN_MESSAGE_BUFF_290 (290UL)
#define MCAN_MESSAGE_BUFF_291 (291UL)
#define MCAN_MESSAGE_BUFF_292 (292UL)
#define MCAN_MESSAGE_BUFF_293 (293UL)
#define MCAN_MESSAGE_BUFF_294 (294UL)
#define MCAN_MESSAGE_BUFF_295 (295UL)
#define MCAN_MESSAGE_BUFF_296 (296UL)
#define MCAN_MESSAGE_BUFF_297 (297UL)
#define MCAN_MESSAGE_BUFF_298 (298UL)
#define MCAN_MESSAGE_BUFF_299 (299UL)
#define MCAN_MESSAGE_BUFF_300 (300UL)
#define MCAN_MESSAGE_BUFF_301 (301UL)
#define MCAN_MESSAGE_BUFF_302 (302UL)
#define MCAN_MESSAGE_BUFF_303 (303UL)
#define MCAN_MESSAGE_BUFF_304 (304UL)
#define MCAN_MESSAGE_BUFF_305 (305UL)
#define MCAN_MESSAGE_BUFF_306 (306UL)
#define MCAN_MESSAGE_BUFF_307 (307UL)
#define MCAN_MESSAGE_BUFF_308 (308UL)
#define MCAN_MESSAGE_BUFF_309 (309UL)
#define MCAN_MESSAGE_BUFF_310 (310UL)
#define MCAN_MESSAGE_BUFF_311 (311UL)
#define MCAN_MESSAGE_BUFF_312 (312UL)
#define MCAN_MESSAGE_BUFF_313 (313UL)
#define MCAN_MESSAGE_BUFF_314 (314UL)
#define MCAN_MESSAGE_BUFF_315 (315UL)
#define MCAN_MESSAGE_BUFF_316 (316UL)
#define MCAN_MESSAGE_BUFF_317 (317UL)
#define MCAN_MESSAGE_BUFF_318 (318UL)
#define MCAN_MESSAGE_BUFF_319 (319UL)
#define MCAN_MESSAGE_BUFF_320 (320UL)
#define MCAN_MESSAGE_BUFF_321 (321UL)
#define MCAN_MESSAGE_BUFF_322 (322UL)
#define MCAN_MESSAGE_BUFF_323 (323UL)
#define MCAN_MESSAGE_BUFF_324 (324UL)
#define MCAN_MESSAGE_BUFF_325 (325UL)
#define MCAN_MESSAGE_BUFF_326 (326UL)
#define MCAN_MESSAGE_BUFF_327 (327UL)
#define MCAN_MESSAGE_BUFF_328 (328UL)
#define MCAN_MESSAGE_BUFF_329 (329UL)
#define MCAN_MESSAGE_BUFF_330 (330UL)
#define MCAN_MESSAGE_BUFF_331 (331UL)
#define MCAN_MESSAGE_BUFF_332 (332UL)
#define MCAN_MESSAGE_BUFF_333 (333UL)
#define MCAN_MESSAGE_BUFF_334 (334UL)
#define MCAN_MESSAGE_BUFF_335 (335UL)
#define MCAN_MESSAGE_BUFF_336 (336UL)
#define MCAN_MESSAGE_BUFF_337 (337UL)
#define MCAN_MESSAGE_BUFF_338 (338UL)
#define MCAN_MESSAGE_BUFF_339 (339UL)
#define MCAN_MESSAGE_BUFF_340 (340UL)
#define MCAN_MESSAGE_BUFF_341 (341UL)
#define MCAN_MESSAGE_BUFF_342 (342UL)
#define MCAN_MESSAGE_BUFF_343 (343UL)
#define MCAN_MESSAGE_BUFF_344 (344UL)
#define MCAN_MESSAGE_BUFF_345 (345UL)
#define MCAN_MESSAGE_BUFF_346 (346UL)
#define MCAN_MESSAGE_BUFF_347 (347UL)
#define MCAN_MESSAGE_BUFF_348 (348UL)
#define MCAN_MESSAGE_BUFF_349 (349UL)
#define MCAN_MESSAGE_BUFF_350 (350UL)
#define MCAN_MESSAGE_BUFF_351 (351UL)
#define MCAN_MESSAGE_BUFF_352 (352UL)
#define MCAN_MESSAGE_BUFF_353 (353UL)
#define MCAN_MESSAGE_BUFF_354 (354UL)
#define MCAN_MESSAGE_BUFF_355 (355UL)
#define MCAN_MESSAGE_BUFF_356 (356UL)
#define MCAN_MESSAGE_BUFF_357 (357UL)
#define MCAN_MESSAGE_BUFF_358 (358UL)
#define MCAN_MESSAGE_BUFF_359 (359UL)
#define MCAN_MESSAGE_BUFF_360 (360UL)
#define MCAN_MESSAGE_BUFF_361 (361UL)
#define MCAN_MESSAGE_BUFF_362 (362UL)
#define MCAN_MESSAGE_BUFF_363 (363UL)
#define MCAN_MESSAGE_BUFF_364 (364UL)
#define MCAN_MESSAGE_BUFF_365 (365UL)
#define MCAN_MESSAGE_BUFF_366 (366UL)
#define MCAN_MESSAGE_BUFF_367 (367UL)
#define MCAN_MESSAGE_BUFF_368 (368UL)
#define MCAN_MESSAGE_BUFF_369 (369UL)
#define MCAN_MESSAGE_BUFF_370 (370UL)
#define MCAN_MESSAGE_BUFF_371 (371UL)
#define MCAN_MESSAGE_BUFF_372 (372UL)
#define MCAN_MESSAGE_BUFF_373 (373UL)
#define MCAN_MESSAGE_BUFF_374 (374UL)
#define MCAN_MESSAGE_BUFF_375 (375UL)
#define MCAN_MESSAGE_BUFF_376 (376UL)
#define MCAN_MESSAGE_BUFF_377 (377UL)
#define MCAN_MESSAGE_BUFF_378 (378UL)
#define MCAN_MESSAGE_BUFF_379 (379UL)
#define MCAN_MESSAGE_BUFF_380 (380UL)
#define MCAN_MESSAGE_BUFF_381 (381UL)
#define MCAN_MESSAGE_BUFF_382 (382UL)
#define MCAN_MESSAGE_BUFF_383 (383UL)
#define MCAN_MESSAGE_BUFF_384 (384UL)
#define MCAN_MESSAGE_BUFF_385 (385UL)
#define MCAN_MESSAGE_BUFF_386 (386UL)
#define MCAN_MESSAGE_BUFF_387 (387UL)
#define MCAN_MESSAGE_BUFF_388 (388UL)
#define MCAN_MESSAGE_BUFF_389 (389UL)
#define MCAN_MESSAGE_BUFF_390 (390UL)
#define MCAN_MESSAGE_BUFF_391 (391UL)
#define MCAN_MESSAGE_BUFF_392 (392UL)
#define MCAN_MESSAGE_BUFF_393 (393UL)
#define MCAN_MESSAGE_BUFF_394 (394UL)
#define MCAN_MESSAGE_BUFF_395 (395UL)
#define MCAN_MESSAGE_BUFF_396 (396UL)
#define MCAN_MESSAGE_BUFF_397 (397UL)
#define MCAN_MESSAGE_BUFF_398 (398UL)
#define MCAN_MESSAGE_BUFF_399 (399UL)
#define MCAN_MESSAGE_BUFF_400 (400UL)
#define MCAN_MESSAGE_BUFF_401 (401UL)
#define MCAN_MESSAGE_BUFF_402 (402UL)
#define MCAN_MESSAGE_BUFF_403 (403UL)
#define MCAN_MESSAGE_BUFF_404 (404UL)
#define MCAN_MESSAGE_BUFF_405 (405UL)
#define MCAN_MESSAGE_BUFF_406 (406UL)
#define MCAN_MESSAGE_BUFF_407 (407UL)
#define MCAN_MESSAGE_BUFF_408 (408UL)
#define MCAN_MESSAGE_BUFF_409 (409UL)
#define MCAN_MESSAGE_BUFF_410 (410UL)
#define MCAN_MESSAGE_BUFF_411 (411UL)
#define MCAN_MESSAGE_BUFF_412 (412UL)
#define MCAN_MESSAGE_BUFF_413 (413UL)
#define MCAN_MESSAGE_BUFF_414 (414UL)
#define MCAN_MESSAGE_BUFF_415 (415UL)
#define MCAN_MESSAGE_BUFF_416 (416UL)
#define MCAN_MESSAGE_BUFF_417 (417UL)
#define MCAN_MESSAGE_BUFF_418 (418UL)
#define MCAN_MESSAGE_BUFF_419 (419UL)
#define MCAN_MESSAGE_BUFF_420 (420UL)
#define MCAN_MESSAGE_BUFF_421 (421UL)
#define MCAN_MESSAGE_BUFF_422 (422UL)
#define MCAN_MESSAGE_BUFF_423 (423UL)
#define MCAN_MESSAGE_BUFF_424 (424UL)
#define MCAN_MESSAGE_BUFF_425 (425UL)
#define MCAN_MESSAGE_BUFF_426 (426UL)
#define MCAN_MESSAGE_BUFF_427 (427UL)
#define MCAN_MESSAGE_BUFF_428 (428UL)
#define MCAN_MESSAGE_BUFF_429 (429UL)
#define MCAN_MESSAGE_BUFF_430 (430UL)
#define MCAN_MESSAGE_BUFF_431 (431UL)
#define MCAN_MESSAGE_BUFF_432 (432UL)
#define MCAN_MESSAGE_BUFF_433 (433UL)
#define MCAN_MESSAGE_BUFF_434 (434UL)
#define MCAN_MESSAGE_BUFF_435 (435UL)
#define MCAN_MESSAGE_BUFF_436 (436UL)
#define MCAN_MESSAGE_BUFF_437 (437UL)
#define MCAN_MESSAGE_BUFF_438 (438UL)
#define MCAN_MESSAGE_BUFF_439 (439UL)
#define MCAN_MESSAGE_BUFF_440 (440UL)
#define MCAN_MESSAGE_BUFF_441 (441UL)
#define MCAN_MESSAGE_BUFF_442 (442UL)
#define MCAN_MESSAGE_BUFF_443 (443UL)
#define MCAN_MESSAGE_BUFF_444 (444UL)
#define MCAN_MESSAGE_BUFF_445 (445UL)
#define MCAN_MESSAGE_BUFF_446 (446UL)
#define MCAN_MESSAGE_BUFF_447 (447UL)
#define MCAN_MESSAGE_BUFF_448 (448UL)
#define MCAN_MESSAGE_BUFF_449 (449UL)
#define MCAN_MESSAGE_BUFF_450 (450UL)
#define MCAN_MESSAGE_BUFF_451 (451UL)
#define MCAN_MESSAGE_BUFF_452 (452UL)
#define MCAN_MESSAGE_BUFF_453 (453UL)
#define MCAN_MESSAGE_BUFF_454 (454UL)
#define MCAN_MESSAGE_BUFF_455 (455UL)
#define MCAN_MESSAGE_BUFF_456 (456UL)
#define MCAN_MESSAGE_BUFF_457 (457UL)
#define MCAN_MESSAGE_BUFF_458 (458UL)
#define MCAN_MESSAGE_BUFF_459 (459UL)
#define MCAN_MESSAGE_BUFF_460 (460UL)
#define MCAN_MESSAGE_BUFF_461 (461UL)
#define MCAN_MESSAGE_BUFF_462 (462UL)
#define MCAN_MESSAGE_BUFF_463 (463UL)
#define MCAN_MESSAGE_BUFF_464 (464UL)
#define MCAN_MESSAGE_BUFF_465 (465UL)
#define MCAN_MESSAGE_BUFF_466 (466UL)
#define MCAN_MESSAGE_BUFF_467 (467UL)
#define MCAN_MESSAGE_BUFF_468 (468UL)
#define MCAN_MESSAGE_BUFF_469 (469UL)
#define MCAN_MESSAGE_BUFF_470 (470UL)
#define MCAN_MESSAGE_BUFF_471 (471UL)
#define MCAN_MESSAGE_BUFF_472 (472UL)
#define MCAN_MESSAGE_BUFF_473 (473UL)
#define MCAN_MESSAGE_BUFF_474 (474UL)
#define MCAN_MESSAGE_BUFF_475 (475UL)
#define MCAN_MESSAGE_BUFF_476 (476UL)
#define MCAN_MESSAGE_BUFF_477 (477UL)
#define MCAN_MESSAGE_BUFF_478 (478UL)
#define MCAN_MESSAGE_BUFF_479 (479UL)
#define MCAN_MESSAGE_BUFF_480 (480UL)
#define MCAN_MESSAGE_BUFF_481 (481UL)
#define MCAN_MESSAGE_BUFF_482 (482UL)
#define MCAN_MESSAGE_BUFF_483 (483UL)
#define MCAN_MESSAGE_BUFF_484 (484UL)
#define MCAN_MESSAGE_BUFF_485 (485UL)
#define MCAN_MESSAGE_BUFF_486 (486UL)
#define MCAN_MESSAGE_BUFF_487 (487UL)
#define MCAN_MESSAGE_BUFF_488 (488UL)
#define MCAN_MESSAGE_BUFF_489 (489UL)
#define MCAN_MESSAGE_BUFF_490 (490UL)
#define MCAN_MESSAGE_BUFF_491 (491UL)
#define MCAN_MESSAGE_BUFF_492 (492UL)
#define MCAN_MESSAGE_BUFF_493 (493UL)
#define MCAN_MESSAGE_BUFF_494 (494UL)
#define MCAN_MESSAGE_BUFF_495 (495UL)
#define MCAN_MESSAGE_BUFF_496 (496UL)
#define MCAN_MESSAGE_BUFF_497 (497UL)
#define MCAN_MESSAGE_BUFF_498 (498UL)
#define MCAN_MESSAGE_BUFF_499 (499UL)
#define MCAN_MESSAGE_BUFF_500 (500UL)
#define MCAN_MESSAGE_BUFF_501 (501UL)
#define MCAN_MESSAGE_BUFF_502 (502UL)
#define MCAN_MESSAGE_BUFF_503 (503UL)
#define MCAN_MESSAGE_BUFF_504 (504UL)
#define MCAN_MESSAGE_BUFF_505 (505UL)
#define MCAN_MESSAGE_BUFF_506 (506UL)
#define MCAN_MESSAGE_BUFF_507 (507UL)
#define MCAN_MESSAGE_BUFF_508 (508UL)
#define MCAN_MESSAGE_BUFF_509 (509UL)
#define MCAN_MESSAGE_BUFF_510 (510UL)
#define MCAN_MESSAGE_BUFF_511 (511UL)
#define MCAN_MESSAGE_BUFF_512 (512UL)
#define MCAN_MESSAGE_BUFF_513 (513UL)
#define MCAN_MESSAGE_BUFF_514 (514UL)
#define MCAN_MESSAGE_BUFF_515 (515UL)
#define MCAN_MESSAGE_BUFF_516 (516UL)
#define MCAN_MESSAGE_BUFF_517 (517UL)
#define MCAN_MESSAGE_BUFF_518 (518UL)
#define MCAN_MESSAGE_BUFF_519 (519UL)
#define MCAN_MESSAGE_BUFF_520 (520UL)
#define MCAN_MESSAGE_BUFF_521 (521UL)
#define MCAN_MESSAGE_BUFF_522 (522UL)
#define MCAN_MESSAGE_BUFF_523 (523UL)
#define MCAN_MESSAGE_BUFF_524 (524UL)
#define MCAN_MESSAGE_BUFF_525 (525UL)
#define MCAN_MESSAGE_BUFF_526 (526UL)
#define MCAN_MESSAGE_BUFF_527 (527UL)
#define MCAN_MESSAGE_BUFF_528 (528UL)
#define MCAN_MESSAGE_BUFF_529 (529UL)
#define MCAN_MESSAGE_BUFF_530 (530UL)
#define MCAN_MESSAGE_BUFF_531 (531UL)
#define MCAN_MESSAGE_BUFF_532 (532UL)
#define MCAN_MESSAGE_BUFF_533 (533UL)
#define MCAN_MESSAGE_BUFF_534 (534UL)
#define MCAN_MESSAGE_BUFF_535 (535UL)
#define MCAN_MESSAGE_BUFF_536 (536UL)
#define MCAN_MESSAGE_BUFF_537 (537UL)
#define MCAN_MESSAGE_BUFF_538 (538UL)
#define MCAN_MESSAGE_BUFF_539 (539UL)
#define MCAN_MESSAGE_BUFF_540 (540UL)
#define MCAN_MESSAGE_BUFF_541 (541UL)
#define MCAN_MESSAGE_BUFF_542 (542UL)
#define MCAN_MESSAGE_BUFF_543 (543UL)
#define MCAN_MESSAGE_BUFF_544 (544UL)
#define MCAN_MESSAGE_BUFF_545 (545UL)
#define MCAN_MESSAGE_BUFF_546 (546UL)
#define MCAN_MESSAGE_BUFF_547 (547UL)
#define MCAN_MESSAGE_BUFF_548 (548UL)
#define MCAN_MESSAGE_BUFF_549 (549UL)
#define MCAN_MESSAGE_BUFF_550 (550UL)
#define MCAN_MESSAGE_BUFF_551 (551UL)
#define MCAN_MESSAGE_BUFF_552 (552UL)
#define MCAN_MESSAGE_BUFF_553 (553UL)
#define MCAN_MESSAGE_BUFF_554 (554UL)
#define MCAN_MESSAGE_BUFF_555 (555UL)
#define MCAN_MESSAGE_BUFF_556 (556UL)
#define MCAN_MESSAGE_BUFF_557 (557UL)
#define MCAN_MESSAGE_BUFF_558 (558UL)
#define MCAN_MESSAGE_BUFF_559 (559UL)
#define MCAN_MESSAGE_BUFF_560 (560UL)
#define MCAN_MESSAGE_BUFF_561 (561UL)
#define MCAN_MESSAGE_BUFF_562 (562UL)
#define MCAN_MESSAGE_BUFF_563 (563UL)
#define MCAN_MESSAGE_BUFF_564 (564UL)
#define MCAN_MESSAGE_BUFF_565 (565UL)
#define MCAN_MESSAGE_BUFF_566 (566UL)
#define MCAN_MESSAGE_BUFF_567 (567UL)
#define MCAN_MESSAGE_BUFF_568 (568UL)
#define MCAN_MESSAGE_BUFF_569 (569UL)
#define MCAN_MESSAGE_BUFF_570 (570UL)
#define MCAN_MESSAGE_BUFF_571 (571UL)
#define MCAN_MESSAGE_BUFF_572 (572UL)
#define MCAN_MESSAGE_BUFF_573 (573UL)
#define MCAN_MESSAGE_BUFF_574 (574UL)
#define MCAN_MESSAGE_BUFF_575 (575UL)
#define MCAN_MESSAGE_BUFF_576 (576UL)
#define MCAN_MESSAGE_BUFF_577 (577UL)
#define MCAN_MESSAGE_BUFF_578 (578UL)
#define MCAN_MESSAGE_BUFF_579 (579UL)
#define MCAN_MESSAGE_BUFF_580 (580UL)
#define MCAN_MESSAGE_BUFF_581 (581UL)
#define MCAN_MESSAGE_BUFF_582 (582UL)
#define MCAN_MESSAGE_BUFF_583 (583UL)
#define MCAN_MESSAGE_BUFF_584 (584UL)
#define MCAN_MESSAGE_BUFF_585 (585UL)
#define MCAN_MESSAGE_BUFF_586 (586UL)
#define MCAN_MESSAGE_BUFF_587 (587UL)
#define MCAN_MESSAGE_BUFF_588 (588UL)
#define MCAN_MESSAGE_BUFF_589 (589UL)
#define MCAN_MESSAGE_BUFF_590 (590UL)
#define MCAN_MESSAGE_BUFF_591 (591UL)
#define MCAN_MESSAGE_BUFF_592 (592UL)
#define MCAN_MESSAGE_BUFF_593 (593UL)
#define MCAN_MESSAGE_BUFF_594 (594UL)
#define MCAN_MESSAGE_BUFF_595 (595UL)
#define MCAN_MESSAGE_BUFF_596 (596UL)
#define MCAN_MESSAGE_BUFF_597 (597UL)
#define MCAN_MESSAGE_BUFF_598 (598UL)
#define MCAN_MESSAGE_BUFF_599 (599UL)
#define MCAN_MESSAGE_BUFF_600 (600UL)
#define MCAN_MESSAGE_BUFF_601 (601UL)
#define MCAN_MESSAGE_BUFF_602 (602UL)
#define MCAN_MESSAGE_BUFF_603 (603UL)
#define MCAN_MESSAGE_BUFF_604 (604UL)
#define MCAN_MESSAGE_BUFF_605 (605UL)
#define MCAN_MESSAGE_BUFF_606 (606UL)
#define MCAN_MESSAGE_BUFF_607 (607UL)
#define MCAN_MESSAGE_BUFF_608 (608UL)
#define MCAN_MESSAGE_BUFF_609 (609UL)
#define MCAN_MESSAGE_BUFF_610 (610UL)
#define MCAN_MESSAGE_BUFF_611 (611UL)
#define MCAN_MESSAGE_BUFF_612 (612UL)
#define MCAN_MESSAGE_BUFF_613 (613UL)
#define MCAN_MESSAGE_BUFF_614 (614UL)
#define MCAN_MESSAGE_BUFF_615 (615UL)
#define MCAN_MESSAGE_BUFF_616 (616UL)
#define MCAN_MESSAGE_BUFF_617 (617UL)
#define MCAN_MESSAGE_BUFF_618 (618UL)
#define MCAN_MESSAGE_BUFF_619 (619UL)
#define MCAN_MESSAGE_BUFF_620 (620UL)
#define MCAN_MESSAGE_BUFF_621 (621UL)
#define MCAN_MESSAGE_BUFF_622 (622UL)
#define MCAN_MESSAGE_BUFF_623 (623UL)
#define MCAN_MESSAGE_BUFF_624 (624UL)
#define MCAN_MESSAGE_BUFF_625 (625UL)
#define MCAN_MESSAGE_BUFF_626 (626UL)
#define MCAN_MESSAGE_BUFF_627 (627UL)
#define MCAN_MESSAGE_BUFF_628 (628UL)
#define MCAN_MESSAGE_BUFF_629 (629UL)
#define MCAN_MESSAGE_BUFF_630 (630UL)
#define MCAN_MESSAGE_BUFF_631 (631UL)
#define MCAN_MESSAGE_BUFF_632 (632UL)
#define MCAN_MESSAGE_BUFF_633 (633UL)
#define MCAN_MESSAGE_BUFF_634 (634UL)
#define MCAN_MESSAGE_BUFF_635 (635UL)
#define MCAN_MESSAGE_BUFF_636 (636UL)
#define MCAN_MESSAGE_BUFF_637 (637UL)
#define MCAN_MESSAGE_BUFF_638 (638UL)
#define MCAN_MESSAGE_BUFF_639 (639UL)


#endif /* HPM_MCAN_H */
